---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.MismatchSystemType
source: html/0ae47e5c-e3d7-8b55-ea21-7c68f9e6042b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.MismatchSystemType Property

Cannot add [Element] to System. The System Type for the available connector does not match the System Type ([Type Name]) for the System.

## Syntax (C#)
```csharp
public static FailureDefinitionId MismatchSystemType { get; }
```